/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/15 13:18:24 by fdarkhaw          #+#    #+#             */
/*   Updated: 2022/02/21 09:36:56 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
ОПИСАНИЕ
Функция atoi() конвертирует начальную часть строки, на которую указывает str,
в целое число. Функция ведет себя так же, как strtol(nptr, (char **)NULL, 10);
за исключением того, что она не определяет ошибок. Строка должна начинаться с
пустых символов (определяемых при помощи isspace(3)), далее должен следовать
один знак: `+' или `-' (если есть).

ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ
Конвертированное значение.
*/

#include "libft.h"

int	ft_atoi(const char *str, int *p)
{
	int	res;
	int	neg;
	int	i;

	res = 0;
	neg = 1;
	i = 0;
	while ((str[i] == ' ') || (str[i] == '\n') || (str[i] == '\t') \
		|| (str[i] == '\v') || (str[i] == '\f') || (str[i] == '\r'))
		i++;
	if (str[i] == '-' || str[i] == '+')
	{
		if (str[i++] == '-')
			neg = -1;
	}
	while (str[i] >= '0' && str[i] <= '9')
	{
		res = (res * 10) + (str[i++] - '0');
		if (str[i] == ',')
			*p = i;
	}
	return (res * neg);
}
/*
#include <stdio.h>

int	main(void)
{
	char	*mas;
	int		p;

	mas = "  \t   \n  +42,  jhgfd";
	printf("ft	: %d\n", ft_atoi(mas, &p));
	printf("c	: %d\n", atoi(mas));
	printf("p	: %d\n", p);
	return (0);
}
*/